applications/solvers/detonationFoam_V2.0/DLBFoam-1.0-1.0_OF8/tutorials/reactingFoam/shearlayer/Allrun
blockMesh
N_PROCS=$(grep -c ^processor /proc/cpuinfo)
foamDictionary -entry NCORES system/decomposeParDict -set $N_PROCS

rm -rf 0
cp -r 0.org 0

decomposePar -force > log.decompose
mpirun -np $N_PROCS reactingFoam -parallel > log.reactingFoam

